CSI API ETABS v1
cDatabaseTables.GetAvailableTables Method
 Returns the tables that are currently available for display.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetAvailableTables(
	ref int NumberTables,
	ref string[] TableKey,
	ref string[] TableName,
	ref int[] ImportType
)
Function GetAvailableTables (
	ByRef NumberTables As Integer,
	ByRef TableKey As String(),
	ByRef TableName As String(),
	ByRef ImportType As Integer()
) As Integer
Dim instance As cDatabaseTables
Dim NumberTables As Integer
Dim TableKey As String()
Dim TableName As String()
Dim ImportType As Integer()
Dim returnValue As Integer
returnValue = instance.GetAvailableTables(NumberTables,
	TableKey, TableName, ImportType)
int GetAvailableTables(
	int% NumberTables,
	array<String^>^% TableKey,
	array<String^>^% TableName,
	array<int>^% ImportType
)
abstract GetAvailableTables :
        NumberTables : int byref *
        TableKey : string[] byref *
        TableName : string[] byref *
        ImportType : int[] byref -> int
Parameters
NumberTables
Type: System.Int32
Returned Item: The number of tables that are currently available for display.
TableKey
Type: System.String[]
Returned Item: A zero-based array of the table keys for the available tables.
TableName
Type: System.String[]
Returned Item: A zero-based array of the table names for the available tables.
ImportType
Type: System.Int32[]
Returned Item: This is either 0, 1, 2 or 3 indicating the import type for the table.
not importable
importable but not interactively importable
importable and interactively importable when the model is unlocked
importable and interactively importable when the model is unlocked and locked
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace